# __project_ = '算法学习'
# __author_ = 'baibe'
# __time_ = '2022/8/19 8:19'

import time
"""位运算的性质
位运算的性质有很多，此处列举位运算中的与、或、异或和取反的常见性质。假设以下出现的变量都是有符号整数。
·幂等律: a & a = a，a | a=a(注意异或不满足幂等律);·
交换律: a& b= b& a，a b=b | a，a^b=b^a;
·结合律:(a & b)& c = a& (b& c)，(a lb)|c= al(b|c)，(a ^b)^c=a^(b^c);
·分配律: (a & b)|c=(a |c)& (b|c)，(a |b)& c= (a& c) |(b& c)，(a^b) & c=(a & c)^(b& c);
·德·摩根律:～ (a & b)=(～a)|(～b),～(a | b)=(～a) &(~ b);
·取反运算性质:-1=～0，-a =～(a - 1);
·与运算性质:a& 0=0,a & (-1)= a，a & (～a)=0;·
或运算性质:a|0= a，a|(～ a)=—1;
·异或运算性质: α^0=a，a^a= 0;·
其他性质
o a & (a -1)的结果为将a的二进制表示的最后一个1变成0;
o a &(-a)(与a&(~(a-1))等价）的结果为只保留α的二进制表示的最后个1，其余的1都变成0"""

if __name__ == '__main__':
    start = time.perf_counter()

    end = time.perf_counter()
    print(end - start)
